---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyTime.Value
source: html/ba1758a2-9c99-9154-e161-07a0e0d10bf6.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyTime.Value Property

Get the value of the property

## Syntax (C#)
```csharp
public DateTime Value { get; }
```